Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: A gesture with two simultaneous gestures.
ja: ２つの同時に作用するジェスチャをもつあるジェスチャ。

source: A gesture you combine with your gesture, to create a new, combined gesture.
ja: あなたがあなたのジェスチャと結合して、ある新しい、結合されたジェスチャを作成するあるジェスチャ。

source: A gesture you want to combine with another gesture to create a new, sequenced gesture.
ja: あなたが別のジェスチャと結合してある新しい、順番に並べられたジェスチャを作成したいあるジェスチャ。

source: A gesture’s updating(_:body:) callback returns a GestureStateGesture instance for updating a transient state property that’s annotated with the GestureState property wrapper.
ja: あるジェスチャのもつupdating(_:body:)コールバックは、ある過渡状態プロパティを更新するためにGestureStateGestureインスタンスを返します、それはGestureStateプロパティラッパーで注釈を付けられます。

source: A globally unique identifier for this Touch Bar.
ja: このTouch Barに対するグローバルに特有な識別子。

source: A globally unique identifier for this item.
ja: この項目に対するグローバルに特有な識別子。

source: A grayscale effect reduces the intensity of colors in this view.
ja: グレイスケール効果は、このビューの中の色の強さを減らします。

source: A guide marking the bottom and leading edges of the view.
ja: ビューの下先端を印しているあるガイド。

source: A guide marking the bottom and trailing edges of the view.
ja: ビューの下後端を印しているあるガイド。

source: A guide marking the bottom edge of the view.
ja: ビューの下端を印しているあるガイド。

source: A guide marking the bottom-most text baseline in a view.
ja: あるビューの中の一番下のテキストベースラインを印しているあるガイド。

source: A guide marking the center of the view.
ja: ビューの中心を印しているあるガイド。

source: A guide marking the horizontal center of the view.
ja: ビューの水平中心を印しているガイド。

source: A guide marking the leading edge of the view.
ja: ビューの先端を印しているあるガイド。

source: A guide marking the top and leading edges of the view.
ja: ビューの上先端を印しているあるガイド。

source: A guide marking the top and trailing edges of the view.
ja: ビューの上後端を印しているガイド。

source: A guide marking the top edge of the view.
ja: ビューの上端を印しているあるガイド。

source: A guide marking the topmost text baseline view.
ja: あるビューの中の一番上のテキストベースラインを印しているあるガイド。

source: A guide marking the trailing edge of the view.
ja: ビューの後端を印しているガイド。

source: A guide marking the vertical center of the view.
ja: ビューの垂直中心を印しているあるガイド。

source: A hashable value.
ja: あるハッシュ可能値。

source: A hidden view.
ja: 隠されたビュー。

source: A horizontal offset you use to position the shadow relative to this view.
ja: このビューに相対して影の位置を定めるのにあなたが使う水平オフセット（補う間隔）。

source: A hosting controller object that you can display in your app's interface.
ja: あるホスティングコントローラオブジェクト、それはあなたがあなたのアプリのもつインターフェイスにおいて表示できます。

source: A hosting controller object that you can use to display notification-related content.
ja: あるホスティングコントローラオブジェクト、それはあなたが通知関連内容を表示するために使用できます。

source: A hosting controller wraps the designated view or view controller and facilitates communication between the wrapped object and your SwiftUI views.
ja: ホスティングコントローラは、指定されたビューまたはビューコントローラをラップします、そしてオブジェクトとあなたのSwiftUIビューの間の通信をやりやすくします。

source: A hosting view acts as a bridge between your SwiftUI views and your AppKit interface.
ja: ホスティングビューは、SwiftUIビューとあなたのAppKitインターフェイスの間のブリッジとしての役割を果たします。

source: A hosting view is an NSView object that manages a single SwiftUI view, which may itself contain other SwiftUI views.
ja: ホスティングビューはNSViewオブジェクトです、それはある単一のSwiftUIビューを管理します、それはそれ自身他のSwiftUIビューを含むかもしれません。

source: A hue rotation effect shifts all of the colors in a view according to the angle you specify.
ja: 色相回転効果は、あるビューの中の色の全てをあなたが指定する角度に応じてずらします。

source: A key for specifying the preferred color scheme.
ja: 望ましいカラースキームを指定するためのあるキー。

source: A key path to a specific resulting value.
ja: 特定の結果値へのキーパス。

source: A layout container that arranges its children in a horizontal line and allows the user to resize them using dividers placed between them.
ja: あるレイアウトコンテナ、それは、それの子らをある水平線に整列します、そしてそれらの間に置かれる仕切りを使ってユーザにそれらの大きさ変更を可能します。

source: A layout container that arranges its children in a vertical line and allows the user to resize them using dividers placed between them.
ja: あるレイアウトコンテナ、それは、それの子らをある垂直線に整列します、そしてそれらの間に置かれる仕切りを使ってユーザにそれらの大きさ変更を可能します。

source: A line from the previous current point to the given point, which becomes the new current point.
ja: 以前の現在の地点から、新しい現在の地点になるこの与えられた地点までの線。

source: A line from the start point of the current subpath (if any) to the current point, which terminates the subpath.
ja: 現在のサブパス（もしあれば）の開始点から、サブパスを終わらせる現在の地点までのある線。

source: A linear gradient.
ja: 線形勾配。

source: A list of elements of the new set.
ja: 新しい集合の要素のリスト。

source: A magnification gesture tracks how a magnification event sequence changes.
ja: 拡大ジェスチャは、どのようにある拡大イベントの一続きが変化するかを追跡します。

source: A manager for a value that provides a way to mutate it.
ja: それを変異させる方法を提供するある値に対するマネージャ。

source: A mapping closure.
ja: マップを行うクロージャ。

source: A modifier that can create another modifier with animation.
ja: ある修飾子、それはアニメーションを備える別の修飾子を作成できます。

source: A modifier that must resolve to a concrete modifier in an environment before use.
ja: ある修飾子、それは具象修飾子へとある環境において使用前に解決しなければなりません。

source: A modifier that you apply to a view or another view modifier, producing a different version of the original value.
ja: ある修飾子、それはあなたがビューまたは別のビュー修飾子に適用するものです、元の値のある異なるバージョンを生成しています。

source: A name used to identify this coordinate space.
ja: この座標空間を識別するのに使われる名前。

source: A named value produced by a view.
ja: あるビューによって生み出された名前付き値。

source: A new binding or nil when base is nil.
ja: 新しいバインディングまたはbaseがnilの場合はnil。

source: A new binding.
ja: 新しいバインディング。

source: A new gesture that combines a gesture with keyboard modifiers.
ja: ある新しいジェスチャ、それはあるジェスチャをキーボード修飾子と結合します。。

source: A new gesture.
ja: 新しいジェスチャ。

source: A new option set made up of the elements contained in this set, in other, or in both.
ja: この集合の中に、otherの中に、または両方の中に含まれる要素から作り上げられるオプションセット。

source: A new option set with only the elements contained in both this set and other.
ja: この集合とotherの両方に含まれる要素のみをもつ新しいオプションセット。

source: A new option set with only the elements contained in either this set or other, but not in both.
ja: この集合またはotherのどちらかに、しかし両方にではなく含まれる要素のみをもつ新しいオプションセット。

source: A new property wrapper for the given key path.
ja: 与えられたキーパスに対する新しいプロパティラッパー。

source: A new set.
ja: 新しい集合。

source: A new text view containing the combined contents of the two input text views.
ja: ２つの入力テキストビューの結合した内容を含んでいるある新しいテキストビュー。

source: A new view that defines an entry in the global database of views synchronizing their geometry.
ja: あるビュー、それは、それらの幾何学を同期しているビューそれらからなるグローバルデータベースにおいてある登録項目を定義するものです。

source: A numeric value.
ja: ある数値。

source: A one-way communications channel between related processes.
ja: 関連プロセス間の一方通行の通信経路。

source: A paint type that repeats an image over the infinite plane.
ja: あるペイント型、それはある画像を無限面にわたって繰り返します。

source: A pair of animatable values, which is itself animatable.
ja: 一対のアニメーション値、それはそれ自身アニメーション可能です。

source: A pair of gestures where only one can succeed, which gives precedence to the first of the pair.
ja: 一対のジェスチャ、そこではただ１つだけが上手くいきます、それは対の最初のものに優先権を与えます。

source: A parent layout should offer children with the highest layout priority all the space offered to the parent minus the minimum space required for all its lower-priority children, and so on for each lower priority value.
ja: 親レイアウトは、最も高いレイアウト優先度をもつ子らに、それのより低い優先度の子ら全てに対して必要とされる最小限の空間を引いて、親に要請された空間全てを提供すべきです。

source: A part of an app’s user interface with a life cycle managed by the system.
ja: システムによって管理されるライフサイクルをもつ、あるアプリのユーザインターフェイスのある部分。

source: A path element that terminates the current subpath (without closing it) and defines a new current point.
ja: あるパス要素、それは現在のサブパスを終えます（それを閉じることなく）、そして新しい現在の地点を定義します。

source: A path that describes this shape.
ja: この形状を記述するパス。

source: A persistent value of a given type, through which a view reads and monitors the value.
ja: ある与えられた型の永続値、それを通してビューは値を読み出しおよび監視します。

source: A picker style that presents the options as a group of radio buttons.
ja: あるピッカースタイル、それはオプションそれらをラジオボタンいくつかからなるあるグループとして提示します。

source: A picker style that presents the options as a menu when the user presses a button.
ja: あるピッカースタイル、それはオプションいくつかをあるメニューとして、ユーザがあるボタンを押す時に提示します。

source: A picker style that presents the options in a scrollable wheel that shows the selected option and a few neighboring options.
ja: あるピッカースタイル、それはオプションそれらをスクロール可能ホイールにおいて提示します、それは選択されたオプションと少数の隣接しているオプションを示します。

source: A picker style that presents the options in a segmented control.
ja: あるピッカースタイル、それはオプションそれらを分節コントロールにおいて提示します。

source: A pipe is a one-way communications channel between related processes; one process writes data, while the other process reads that data.
ja: パイプは、関連プロセス間の一方通行の通信経路です；一方のプロセスはデータを書き出します、それに対して他方のプロセスはそのデータを読み出します。

source: A positive value increases the spacing between characters, while a negative value brings the characters closer together.
ja: 正の値は文字の間の空間を増やします、一方で負の値は文字を密接するようにします。

source: A predicate that returns true if its first argument should be ordered before its second argument; otherwise, false.
ja: ある述部、それはそれの最初の引数がそれの２番目の引数の前に並べられるべきならばtrueを返します；そうでなければ、false。

source: A predicate that returns true if its two arguments are equivalent; otherwise, false.
ja: ある述部、それはそれの２つの引数が等しいならばtrueを返します；そうでなければ、false。

source: A prediction of what the final translation would be if dragging stopped now, based on the current drag velocity.
ja: 今ドラッグが停止したならば転換は何になるだろうかの予測、現在のドラッグ速度に基づきます。

source: A prediction of where the final location would be if dragging stopped now, based on the current drag velocity.
ja: 今ドラッグが停止したならば最終的な場所はどこになるだろうかの予測、現在のドラッグ速度に基づきます。

source: A prediction, based on the current drag velocity, of what the final translation will be if dragging stopped now.
ja: 今ドラッグが停止したならば最終的な変形がそれになるであろう、現在のドラッグ速度に基づく、ある予測。

source: A prediction, based on the current drag velocity, of where the final location will be if dragging stopped now.
ja: 今ドラッグが停止したならば最終的な場所がそこになるであろう、現在のドラッグ速度に基づく、ある予測。

source: A process operates within an environment defined by the current values for several items: the current directory, standard input, standard output, standard error, and the values of any environment variables.
ja: プロセスは、いくつかの項目：現在のディレクトリ、標準入力、標準出力、標準エラー、そして何らかの環境変数の値に対して、現在の値によって定義されるある環境内で演算します。

source: A process's environment cannot be changed while it is running.
ja: プロセスのもつ環境は、それが実行中に変更されることはできません。

source: A projection of the binding value that returns a binding.
ja: バインディング値のある投影、それはあるバインディングを返します。

source: A projection of the environment object that creates bindings to its properties using dynamic member lookup.
ja: 環境オブジェクトのある投影、それはバインディングをそれのプロパティに対して動的メンバー検索を使って作成します。

source: A projection of the observed object that creates bindings to its properties using dynamic member lookup.
ja: 監視対象オブジェクトのある投影、それはバインディングをそれのプロパティに対して動的メンバー検索を使って作成します。

source: A property that’s declared as @GestureState implicitly resets when the gesture becomes inactive, making it suitable for tracking transient state.
ja: @GestureStateとして宣言されるプロパティは、ジェスチャが静止状態になる場合に暗黙的にリセットして、それを過渡状態の追跡に適するようにします。

source: A property wrapper for observing values from the focused view or one of its ancestors.
ja: フォーカスされたビューまたはそれの祖先の１つからの監視している値に対するプロパティラッパー。

source: A property wrapper type for an observable object supplied by a parent or ancestor view.
ja: 親または祖先ビューによって提供される監視可能なオブジェクトに対するプロパティラッパー型。

source: A property wrapper type that can read and write a value managed by SwiftUI.
ja: あるプロパティラッパー型、それはSwiftUIによって管理される値を読み書き可能です。

source: A property wrapper type that can read and write a value owned by a source of truth.
ja: あるプロパティラッパー型、それは信頼できる情報源によって所有される値を読み書き可能です。

source: A property wrapper type that makes fetch requests and retrieves the results from a Core Data store.
ja: あるプロパティラッパー型、それはフェッチリクエストを作ります、そしてCore Dataストアから結果を回収します。

source: A property wrapper type that reads a value from the view’s environment.
ja: あるプロパティラッパー型、それは値をビューのもつ環境から読み出します。

source: A property wrapper type that subscribes to an observable object and invalidates a view whenever the observable object changes.
ja: あるプロパティラッパー型、それは監視可能オブジェクトを定期購買します、そして監視可能オブジェクトが変化する時はいつでもビューを無効にします。

source: A property wrapper type that updates a property while the user performs a gesture and resets the property back to its initial state when the gesture ends.
ja: あるプロパティラッパー型、それは、あるプロパティをユーザがジェスチャを実行する間に更新します、そしてそのプロパティをジェスチャが終わる時にそれの初期状態へと再設定します。

source: A protocol for identifier types used when publishing and observing focused values.
ja: フォーカスされた値を出版および監視するときに使われる識別子型に対するプロトコル。

source: A protocol that describes the behavior and appearance of a list.
ja: リストの挙動と外観を記述するプロトコル。

source: A protocol that represents an environment key.
ja: あるプロパティ、それは環境キーを表します。

source: A proxy for access to the size and coordinate space (for anchor resolution) of the container view.
ja: コンテナビューの（アンカー解決のための）大きさと座標空間にアクセスするためのプロキシ。

source: A quadratic Bézier curve from the previous current point to the given end-point, using the single control point to define the curve.
ja: 以前の現在の地点からこの与えられた終了点までの２次ベジェ曲線、ただ１つの制御点を曲線を定義するのに使っています。

source: A radial gradient.
ja: 放射状の色勾配。

source: A random element from the collection.
ja: コレクションからのある無作為な要素。

source: A range of the collection’s indices.
ja: コレクションのもつインデックスのある範囲。

source: A rectangle containing all path segments.
ja: 全てのパス断片を含んでいる矩形を返します。

source: A rectangular shape aligned inside the frame of the view containing it.
ja: ある長方形、それを含んでいるビューの枠内に整列されます。

source: A rectangular shape with rounded corners, aligned inside the frame of the view containing it.
ja: 角を丸められたある長方形、それを含んでいるビューの枠内に整列されます。

source: A representable object wraps a set of SwiftUI views in a form that you can then add to your storyboard-based app.
ja: 表現可能オブジェクトは一揃いのSwiftUIビューをラップします、あなたがそれからあなたのストーリーボード基盤アプリへと加えることができるある形式で。

source: A representation of a Document Type Definition.
ja: ある「文書型定義」の表現。

source: A representation of element, attribute-list, entity, and notation declarations in a Document Type Definition.
ja: 「文書型定義」における要素、属性リスト、エンティティ、そして表記法宣言の表現。

source: A rotated shape.
ja: ある回転した形状。

source: A rotation gesture tracks how a rotation event sequence changes.
ja: 回転ジェスチャは、どのように回転イベントシーケンスが変化するかを追跡します。

source: A scale factor applied to the image while being drawn.
ja: 描画されている間に画像に適用される拡大縮小係数。

source: A scaled form of this shape.
ja: この形状の拡大縮小された形態。

source: A scene that enables support for opening, creating, and saving documents.
ja: あるシーン、それは書類を開く、作成する、そして保存することに対するサポートを可能にします。

source: A scene that presents a group of identically structured windows.
ja: あるシーン、それは同様に構造化されたウインドウそれらからなるあるグループを表します。

source: A scene that presents an interface for viewing and modifying an app’s settings.
ja: あるシーン、それはあるインターフェイスをアプリのもつ設定を眺めるそして修正するために提示します。

source: A scene that triggers an action in response to a change.
ja: あるシーン、それはあるアクションをある変化に答えて引き起こします。

source: A scene which appears in response to receiving the specified category of remote or local notifications.
ja: あるシーン、それはリモートまたはローカルの通知のこの指定されたカテゴリを受信することに応答して現れます。

source: A scroll view.
ja: スクロールビュー。

source: A scrollable view.
ja: スクロール可能なビュー。

source: A sequence containing the same elements as this sequence, but on which some operations, such as map and filter, are implemented lazily.
ja: このシーケンスと同じ要素を含んでいるシーケンス、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A sequence of pairs enumerating the sequence.
ja: このシーケンスを列挙している、ペアからなるあるシーケンス。

source: A sequence to compare to this sequence.
ja: あるシーケンス、このシーケンスと比べることになります。

source: A sequence to insert between each of this sequence’s elements.
ja: このシーケンスの要素それぞれの間に挿入されるシーケンス。

source: A set of accessibility traits that describe how an element behaves.
ja: 一揃いのアクセシビリティ特徴（トレイト）、それはどのように要素が振舞うかを記述します。

source: A set of colors that are used by system elements and applications.
ja: いくつかの色からなるある集合、それはシステム要素およびアプリケーションによって使われます。

source: A set of flags corresponding to the modifier keys that must be down in order for the gesture to succeed.
ja: ジェスチャが成功するために押されなければならない修飾キーそれらに対応している一揃いのフラグ。

source: A set of flags that correspond to the modifier keys that the user needs to hold down.
ja: ユーザが押下する必要がある修飾キーに対応するフラグの一揃い。

source: A set of key modifiers that you can add to a gesture.
ja: 一揃いのキー修飾子、それはあなたがあるジェスチャに加えることができるものです。

source: A set of the same type as the current set.
ja: 現在の集合と同じ型の集合。

source: A set of types used to improve a view’s comprehensibility, interactivity, and navigability.
ja: ビューのもつ理解可能性、相互作用性、そして誘導可能性を改良するのに使われる一揃いの型。

source: A set of values that indicate the visual size available to the view.
ja: 一揃いの値、それはビューに利用可能な視覚的大きさを指し示します。

source: A shape built by capturing a portion of this shape’s path.
ja: この形状のもつパスのある部分を捕らえることで造られたある形状。

source: A shape offset by the specified amount.
ja: 指定量だけ位置埋め合わせされた形状。

source: A shape style that fills a shape by repeating a region of an image.
ja: ある形状スタイル、それはある形状をある画像のある領域を繰り返すことによっていっぱいに満たします。

source: A shape type that is able to inset itself to produce another shape.
ja: ある形状型、それはそれ自身にインセット（縁差込）をすることで別の形状を生み出せます。

source: A shape with a rotation transform applied to it.
ja: それへと適用される回転変形した状態でのある形状。

source: A shape with a scale transform applied to it.
ja: それへと適用される拡大縮小変形した状態でのある形状。

source: A shape with a translation offset transform applied to it.
ja: それへと適用される転換オフセット変形した状態でのある形状。

source: A shape with an affine transform applied to it.
ja: それへと適用されるアフィン変換した状態でのある形状。

source: A shuffled array of this sequence’s elements.
ja: このシーケンスの持つ要素からなるあるシャッフルされた配列。

source: A simple container for a single C or Objective-C data item.
ja: 単一のCまたはObjective-Cデータ項目に対する単純なコンテナ。

source: A simultaneous gesture is a container-event handler that evaluates its two child gestures at the same time.
ja: ある同時ジェスチャは、コンテナイベントハンドラです、それはそれの２つの子ジェスチャを同時に評価します。

source: A single, concatenated string.
ja: 単一の、連結された文字列。

source: A size class indicating a compact size class.
ja: ある小型の大きさのクラスを指し示すサイズクラス。

source: A size class indicating a regular size class.
ja: 通常の大きさのクラスを指し示すサイズクラス。

source: A size specifying the ratio of width to height to use for the resulting view.
ja: 結果のビューに対して使う幅と硬さの比率を指定している寸法。

source: A sorted array of the sequence’s elements.
ja: このシーケンス要素のソート済み配列。

source: A specialized regular expression object that matches natural language text for predefined data patterns.
ja: ある特殊化された正規表現オブジェクトで、自然言語テキストをあらかじめ定義されたデータパターンと照合します。

source: A specification for the appearance and interaction of a DatePicker.
ja: DatePickerの外観と相互作用に対する仕様。

source: A specification for the appearance and interaction of a List.
ja: あるListの外観と相互作用に対する仕様。

source: A specification for the appearance and interaction of a Toggle.
ja: あるToggleの外観と相互作用に対する仕様。

source: A specification for the appearance and interaction of a text field.
ja: あるテキストフィールドのの外観と相互作用に対する仕様。

source: A stable sort preserves the relative order of elements for which areInIncreasingOrder does not establish an order.
ja: 安定ソートは、それに対してareInIncreasingOrderが順序を確立しない要素それらの相対順序を保全します。

source: A stable sort preserves the relative order of elements that compare equal.
ja: 安定ソートは、等しいと比較される要素それらの相対順序を保全します。

source: A standard label for user interface items, consisting of an icon with a title.
ja: ユーザインターフェイス項目に対する、あるタイトル付きのアイコンからなる標準ラベル。

source: A storage type for an action sheet presentation.
ja: アクションシート提示のためのストレージ型。

source: A stored variable that updates an external property of a view.
ja: ある格納変数、それはあるビューの外部プロパティを更新します。

source: A string parser that scans for substrings or characters in a character set, and for numeric values from decimal, hexadecimal, and floating-point representations.
ja: ある文字列パーサー、それはある文字集合での下位文字列または文字を求めて、そして10進、16進、および浮動小数点表現からの数値を求めて、走査します。

source: A string that describes the purpose of the button’s action.
ja: ある文字列、それはボタンのもつactionの目的を記述します。

source: A string that represents the contents of the environment values instance.
ja: ある文字列、それは環境値インスタンスの内容を表します。

source: A string to display without localization.
ja: ローカライゼーションなしで表示する文字列。

source: A string to insert between each of the elements in this sequence.
ja: このシーケンスの要素のそれぞれの間に挿入されることになる文字列。

source: A stroked shape.
ja: 線をつけられた形状。

source: A structure that computes views and disclosure groups on demand from an underlying collection of tree-structured, identified data.
ja: ある構造体、それはビューおよび開示グループを要求に応じてツリー構造の、識別可能なデータからなるある基礎をなすコレクションから計算します。

source: A structure that computes views on demand from an underlying collection of of identified data.
ja: ある構造体、それはビューそれらを要請に応じてある識別されたデータの基礎をなすコレクションから計算します。

source: A style appropriate for foreground separator or border lines.
ja: 前景セパレータまたは境界線に対して適切なスタイル。

source: A style for displaying the title of a navigation bar.
ja: ナビゲーションバーのタイトルを表示するためのスタイル。

source: A style for rasterizing vector shapes.
ja: ベクター形状のラスタライズに対するスタイル。

source: A style that shows the correct fill for the background based on the current context.
ja: あるスタイル、それは背景に対する正しいフィルを現在の文脈に基づいて示します。

source: A style that shows the correct fill for the foreground based on the current context.
ja: あるスタイル、それは前景に対する正しいフィルを現在の文脈に基づいて示します。

source: A style usable as the backgrounds for selected elements.
ja: 選択された要素に対する背景として使用できるスタイル。

source: A stylized view with an optional label that is associated with a logical grouping of content.
ja: 内容の論理グループと結びつけられる随意のラベルでスタイル指定されたビュー。

source: A subsequence starting after the specified number of elements.
ja: 指定された数の要素の後から始まる下位シーケンス。

source: A subsequence starting at the start position.
ja: start位置から始まる下位シーケンス。

source: A subsequence starting at the beginning of this collection with at most maxLength elements.
ja: このコレクションの先端で始まる多くともmaxLength要素の下位シーケンス。

source: A subsequence terminating at the end of the collection with at most maxLength elements.
ja: コレクションの末端で終わる多くともmaxLength要素の下位シーケンス。

source: A subsequence that leaves off k elements from the end.
ja: ある下位シーケンス、それはk個の要素を終わりから取り除いたものです。

source: A subsequence up to, and including, the end position.
ja: end位置に至るまでの、そしてそれを含む、下位シーケンス。

source: A subsequence up to, but not including, the end position.
ja: end位置に至るまでの、しかしそれを含まないシーケンス。

source: A system button that triggers reading data from the pasteboard.
ja: あるシステムボタン、それはペーストボードからのデータの読み出しを引き起こします。

source: A system style of DatePicker that displays an interactive calendar or clock.
ja: DatePickerのあるシステムスタイル、それは対話式のカレンダーまたは時計を表示します。

source: A system style of date picker that displays each component as columns in a scrollable wheel.
ja: 日付ピッカーのあるシステムスタイル、それは各構成要素をスクロール可能なホイールの中の縦欄それらとして表示します。

source: A system style that displays the components in an editable field, with adjoining stepper that can increment/decrement the selected component.
ja: あるシステムスタイル、それは構成要素それらをある編集可能なフィールドの中に表示します、隣接するステッパー（昇降器）を備えます、それは選択された構成要素を漸増／漸減できるものです。

source: A system style that displays the components in an editable field.
ja: あるシステムスタイル、それは構成要素それらをある編集可能なフィールドの中に表示します。

source: A text view always uses exactly the amount of space it needs to display its rendered contents, but you can affect the view’s layout.
ja: テキストビューは常に正確にそれの描出された内容を表示するのにそれが必要とする空きの量を使います、しかしあなたはビューのもつレイアウトに影響を与えられます。

source: A text view draws a string in your app’s user interface using a body font that’s appropriate for the current platform.
ja: テキストビューは、ある文字列をあなたのアプリのもつユーザインターフェイスにおいて、現在のプラットホームに適切であるbodyフォントを使用して描画します。

source: A text view showing a truncated quote from Hamlet starting Brevity is t and ending with three dots.
ja: Brevity is tで始まり３つのドットで終わるある切り詰められた引用をHamletから示しているテキストビュー。

source: A text view that uses the color value you supply.
ja: あなたが提供する色値を使うテキストビュー。

source: A textual representation of this instance.
ja: このインスタンスのテキスト表現。

source: A title for this view to display in the navigation bar.
ja: ナビゲーションバーにおいて表示する、このビューに対するタイトル。

source: A toggle style that displays a checkbox followed by its label.
ja: あるトグルスタイル、それはチェックボックスに続けてそれのラベルを表示します。

source: A toggle style that displays a leading label and a trailing switch.
ja: あるトグルスタイル、それは先頭のラベルと後続のスイッチを表示します。

source: A trait that describes the behavior for this Touch Bar view.
ja: このTouch Barビューの挙動を記述するある特徴。

source: A transaction that provides metadata for view updates.
ja: あるトランザクション、それはビューを更新するためのメタデータを提供します。
